{"intents": [
        {"tag": "greeting",
         "patterns": ["Hi", 
                      "How are you", 
                      "Is anyone there?", 
                      "Hello", 
                      "Good day", 
                      "Whats up"],
         "responses": ["Hey there! Let's debate!", 
                       "Hello! Time to debate!", 
                       "Hi there! Let's debate!"],
         "context_set": ""
        },
        {"tag": "goodbye",
         "patterns": ["cya", 
                      "See you later", 
                      "Goodbye", 
                      "I am Leaving", 
                      "Have a Good day"],
         "responses": ["Good conversation!", 
                       "Goodbye!", 
                       "Thanks for debating with me!"],
         "context_set": ""
        },
        {"tag": "name",
         "patterns": ["what is your name", 
                      "what should I call you", 
                      "whats your name?",
                      "who is this?"],
         "responses": ["You can call me DebateBot.", 
                       "I'm DebateBot!", 
                       "This is DebateBot."],
         "context_set": ""
        },
        {"tag": "fun",
         "patterns": ["bullfighting is fun to watch", 
                      "we grew up with bullfighting", 
                      "bulls are just animals, its fun to play with them",
                      "bulls are not being harmed",
                      "we are just playing with bulls"],
         "responses": ["Bullfighting is cruel. It involves hurting young calves for entertainment",
                       "Animals should not be harmed for human entertainment",
                       "The bulls suffer severe stress and die a slow and torturous death",
                       "There is no fun in watching someone kill an innocent animal",
                       "Bullfighting degrades the animal and the people participating. No one should be proud of terrorizing and torturing an animal trapped in a ring"],
         "context_set": ""
        },
        {"tag": "culture",
         "patterns": ["bullfighting is a part of Spanish culture", 
                      "culture must be preserved", 
                      "culture is identity and identity must not be stolen",
                      "this practice attracts tourists",
                      "this is Spain's culture and national character"],
         "responses": ["It presents Spain's culture as violent and diminishes its international reputation. Only 19% of Spanish people support bullfighting. 58% oppose it.",
                       "It leads to sterotypes for Spanish people (as violent) which many Spanish people do not identify with. Only 19% of Spanish people support bullfighting. 58% oppose it.",
                       "Even though it may be a part of culture, old culture must sometimes adapt to new ways of life and bullfighting in this case is unacceptable. Only 19% of Spanish people support bullfighting. 58% oppose it.",
                       "Animal-rights activists view this practice as violent and cruel. Only 19% of Spanish people support bullfighting. 58% oppose it.",
                       "Only 19% of Spanish people support bullfighting. 58% oppose it."],
         "context_set": ""
        },
        {"tag": "harm",
         "patterns": ["bullfighting does not cause as much harm to animals as other industries do", 
                      "humans eat beef and wear leather and these industries cause more harm to animals", 
                      "animals are not sentient like humans are",
                      "animals do not have souls and do not feel pain"],
         "responses": ["There is evidence that these bulls experience prolonged emotional reactions to physical and emotional trauma",
                       "If an activity harms innocent creatures, people should stop the practice. Also, evidence suggests that animals possess some kind of sentience.",
                       "Many studies have shown that animals also possess characteristics associated with sentience"
                       ],
         "context_set": ""
        }
   ]
}
